package lessons.StillOop;

/*
    Шаблонные методы
        Задание 1
        Напишите шаблонный метод, который возвращает максимум из трёх переданных параметров.
        Задание 2
        Напишите шаблонный метод, который возвращает минимум из пяти переданных параметров
    Шаблонные классы
        Задача 1
        Создайте шаблонный класс Array, который представляет собой массив, позволяющий хранить объекты
        заданного типа. Необходимо реализовать:
         ■ заполнение массива с клавиатуры;
         ■ заполнение массива случайными числами;
         ■ отображение массива;
         ■ поиск максимального значения;
         ■ поиск минимального значения;
         ■ подсчет среднеарифметического значения;
         ■ сортировка массива по возрастанию;
         ■ сортировка массива по убыванию;
         ■ поиск значения в массиве,используя бинарный поиск;
         ■ замена значения в массиве на новое значение
 */
public class Main {
    public static void main(String[] args) {
//        System.out.println(max(22.7, 3.8));
        Array array = new Array();
        array.addItems();
        System.out.println(array);
        array.addItemsRandom();
        System.out.println(array);
    }

    public static <T extends Comparable <T>> T max(T... vals) {
        T max = vals[0];
        for (int i = 0; i < vals.length; i++) {
            if (vals[i].compareTo(max) > 0) {
                max = vals[i];
            }
        }
        return (T) max;
    }
}
