package homeworks.Polymorphism.task4;

/*
    Создайте систему управления меню в ресторане, используя наследование и полиморфизм.
    1. Создайте базовый класс MenuItem, представляющий отдельный пункт меню в ресторане. Этот класс должен содержать атрибуты, такие как name (название блюда), description (описание блюда), price (цена). Реализуйте метод display(), который выводит информацию о блюде.
    2. Унаследуйте от MenuItem несколько подклассов, например, Appetizer, MainCourse, Dessert. Каждый подкласс будет представлять определенный тип блюда, имея свои уникальные характеристики (например, Appetizer может содержать информацию о размере порции, MainCourse - типе мяса или основном ингредиенте, Dessert - типе десерта).
    3. Переопределите метод display() в каждом подклассе так, чтобы он выводил информацию о конкретном типе блюда.
    4. Создайте массив объектов типа MenuItem и поместите в него объекты разных типов блюд. Продемонстрируйте полиморфизм, перебирая элементы массива и вызывая метод display() для каждого блюда.

 */
public class Main {
    public static void main(String[] args) {
        MenuItem[] menuItems = {
                new Appetizer("Салат", "описание", 100, 50),
                new Dessert("Десерт", "описание", 100, "тип"),
                new MainCourse("Отбивная", "описание", 200, "тир"),
        };

        for (int i = 0; i < menuItems.length; i++) {
            menuItems[i].display();
        }
    }
}
