package homeworks.Polymorphism.task3;

/*
    Задача 3*: Школа и её учебные предметы
    1. Создайте систему для управления учебными предметами в школе с использованием наследования и полиморфизма.
    Создайте базовый класс Subject, который будет представлять общие характеристики для всех предметов, например, name, teacher. Этот класс должен содержать метод study(), который выводит информацию о изучении предмета.
    2. Унаследуйте от класса Subject несколько подклассов: Math, History, Science. Каждый из этих классов должен представлять конкретный учебный предмет со своими уникальными характеристиками, например, Math может содержать информацию о типе математики (алгебра, геометрия), History - о периоде истории, Science - о типе науки (физика, химия).
    3. Переопределите метод study() в каждом подклассе так, чтобы он выводил информацию о изучении соответствующего предмета.
    4. Создайте массив объектов типа Subject и поместите в него объекты разных типов учебных предметов. Продемонстрируйте полиморфизм, перебирая элементы массива и вызывая метод study() для каждого предмета.
 */
public class Math extends Subject {
    public enum Type {
        ALGEBRA,
        GEOMETRY,
    }
    Type type;

    public Math(String name, String teacher, Type type) {
        super(name, teacher);
        this.type = type;
    }

    @Override
    public void study() {
        super.study();
        System.out.print(", type='" + type + '\'' + '}' + '\n');
    }
}


