package lessons.ArrayList.Stack.StackFixed;


/*
Задание 1.
     Реализуйте класс стека для работы с целыми значениями (стек целых). Стек должен иметь фиксированный размер.
     Реализуйте набор операций для работы со стеком:
     ■ помещение целого значения в стек,
     ■ выталкивание целого значения из стека,
     ■ подсчет количества целых в стеке,
     ■ проверку пустой ли стек,
     ■ проверку полный ли стек,
     ■ очистку стека,
     ■ получение значения без выталкивания верхнего целого в стеке.
     При старте приложения нужно отобразить меню с помощью, которого пользователь может выбрать необходимую операцию
 */
public class Main {
    public static void main(String[] args) {
        AppStackFixed app = new AppStackFixed();
        app.start();
    }
}
