package homeworks.Stream;

import java.util.Random;

public class Generator {
    private static final String[] firstNamesMale = {
            "Иван", "Петр", "Алексей", "Сергей", "Дмитрий",
            "Андрей", "Михаил", "Николай", "Артем", "Виктор",
            "Игорь", "Павел", "Владимир", "Константин", "Василий",
            "Роман", "Станислав", "Анатолий", "Григорий", "Федор",
            "Борис", "Валерий", "Геннадий", "Денис", "Степан",
            "Аркадий", "Леонид", "Руслан", "Вячеслав", "Георгий",
            "Тимофей", "Ярослав", "Илья", "Максим", "Ростислав",
            "Семен", "Валерий", "Эдуард", "Всеволод", "Арсений",
            "Мирон", "Платон", "Глеб", "Савва", "Тихон",
            "Артемий", "Марк", "Даниил", "Егор", "Святослав"
    };
    private static final String[] lastNamesMale = {
            "Иванов", "Петров", "Сидоров", "Васильев", "Федоров",
            "Волков", "Семенов", "Лебедев", "Козлов", "Николаев",
            "Белов", "Орлов", "Яковлев", "Гусев", "Кузьмин",
            "Жуков", "Киселев", "Крылов", "Тихонов", "Ефимов",
            "Комиссаров", "Осипов", "Зайцев", "Савельев", "Романов",
            "Поляков", "Виноградов", "Большаков", "Назаров", "Шестаков",
            "Прохоров", "Сергеев", "Панов", "Гаврилов", "Марков",
            "Абрамов", "Суханов", "Ильин", "Баранов", "Чернов",
            "Широков", "Федосеев", "Денисов", "Рыбаков", "Пономарев",
            "Лазарев", "Сазонов", "Маслов", "Веселов", "Блинов"
    };
    private static final String[] firstNamesFemale = {
            "Анна", "Мария", "Елена", "Ольга", "Наталья",
            "Ирина", "Татьяна", "Екатерина", "Светлана", "Юлия",
            "Анастасия", "Дарья", "Александра", "Ксения", "Евгения",
            "Вера", "Людмила", "Галина", "Валентина", "Надежда",
            "Маргарита", "Алина", "Виктория", "Полина", "София",
            "Алиса", "Валерия", "Диана", "Карина", "Кристина",
            "Лариса", "Любовь", "Марьяна", "Милана", "Нина",
            "Олеся", "Регина", "Снежана", "Тамара", "Ульяна",
            "Элина", "Яна", "Ангелина", "Варвара", "Елизавета",
            "Жанна", "Зоя", "Инна", "Кира", "Лидия"
    };
    private static final String[] lastNamesFemale = {
            "Иванова", "Петрова", "Сидорова", "Васильева", "Кузнецова",
            "Смирнова", "Попова", "Новикова", "Морозова", "Волкова",
            "Лебедева", "Козлова", "Соколова", "Павлова", "Романова",
            "Федорова", "Николаева", "Андреева", "Макарова", "Захарова",
            "Зайцева", "Григорьева", "Белова", "Тимофеева", "Киселева",
            "Савельева", "Яковлева", "Данилова", "Герасимова", "Титова",
            "Фомина", "Егорова", "Назарова", "Орлова", "Александрова",
            "Степанова", "Ушакова", "Максимова", "Филиппова", "Коновалова",
            "Ильина", "Гусева", "Тихонова", "Семенова", "Шестакова",
            "Борисова", "Королева", "Дмитриева", "Беляева", "Антонова"
    };
    private static final int MIN_AGE = 5;
    private static final int MAX_AGE = 100;
    private static final Random RANDOM = new Random();


    public static String generateName(Gender gender) {
        return switch (gender) {
            case Gender.FEMALE -> firstNamesFemale[RANDOM.nextInt(firstNamesFemale.length)] + " " +
                    lastNamesFemale[RANDOM.nextInt(lastNamesFemale.length)];
            case Gender.MALE -> firstNamesMale[RANDOM.nextInt(firstNamesMale.length)] + " " +
                    lastNamesMale[RANDOM.nextInt(lastNamesMale.length)];
        };
    }

    public static int generateAge() {
        return RANDOM.nextInt(MAX_AGE - MIN_AGE + 1) + MIN_AGE;
    }


    public static int generateNumber(int $min, int max) {
        return RANDOM.nextInt(max - $min + 1) + $min;
    }


    public static Gender generateGender() {
        double probabilityTrue = 0.5; // 70% вероятность true
        return RANDOM.nextDouble() < probabilityTrue ? Gender.MALE : Gender.FEMALE;
    }
}
